export default {
  0: {
    status: 500,
    message: 'Ошибка сервера',
  },
  1: {
    status: 404,
    message: 'Не найдено',
  },
  10: {
    status: 500,
    message: 'Ошибка создания пользователя',
  },
  20: {
    status: 400,
    message: 'Такого пользователя не существует',
  },
  30: {
    status: 400,
    message: 'Неверные авторизационные данные',
  },
  40: {
    status: 400,
    message: 'В чате должно быть минимум 2 пользователя',
  },
  50: {
    status: 400,
    message: 'У вас нет доступа к этим данным',
  },
  60: {
    status: 500,
    message: 'Ошибка отправки сообщения',
  },
  70: {
    status: 400,
    message: 'Неверный вид файла',
  },
  80: {
    status: 400,
    message: 'Неверная комната чата',
  },
  90: {
    status: 400,
    message: 'Вы не можете отправлять сообщения в этот чат',
  },
  100: {
    status: 400,
    message: 'Неверное вложение',
  },
  110: {
    status: 400,
    message: 'Не все вложения загружены',
  },
};
