export default {
  0: {
    status: 500,
    message: 'Ошибка сервера',
  },
  1: {
    status: 404,
    message: 'Не найдено',
  },
  10: {
    status: 500,
    message: 'Ошибка создания пользователя',
  },
  20: {
    status: 400,
    message: 'Такого пользователя не существует',
  },
  30: {
    status: 400,
    message: 'Неверные авторизационные данные',
  },
  40: {
    status: 400,
    message: 'В чате должно быть минимум 2 пользователя',
  },
  50: {
    status: 400,
    message: 'У вас нет доступа к этим данным',
  },
};
